### Terragrunt Plan for `live/dev/demo-cost`
**Plan: 5 to add, 6 to change, 0 to destroy.**
<details><summary>Full Plan Output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service.backend[0] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
      ~ effective_labels        = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        id                      = "projects/dev-iac-demo/locations/us-central1/services/demo-cost-backend"
      ~ labels                  = {
          ~ "team"        = "finops-team" -> "finops-team-2"
            # (2 unchanged elements hidden)
        }
        name                    = "demo-cost-backend"
      ~ terraform_labels        = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - max_instance_count    = 20 -> null
          - min_instance_count    = 0 -> null
        }

      ~ template {
          ~ max_instance_request_concurrency = 320 -> 20
            # (7 unchanged attributes hidden)

          ~ containers {
                # (5 unchanged attributes hidden)

              ~ resources {
                  ~ limits            = {
                      ~ "memory" = "2Gi" -> "8Gi"
                        # (1 unchanged element hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ scaling {
              ~ max_instance_count = 10 -> 20
              ~ min_instance_count = 2 -> 10
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.frontend[0] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "frontend" {
      ~ effective_labels        = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        id                      = "projects/dev-iac-demo/locations/us-central1/services/demo-cost-frontend"
      ~ labels                  = {
          ~ "team"        = "finops-team" -> "finops-team-2"
            # (2 unchanged elements hidden)
        }
        name                    = "demo-cost-frontend"
      ~ terraform_labels        = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - max_instance_count    = 20 -> null
          - min_instance_count    = 0 -> null
        }

      ~ template {
          ~ max_instance_request_concurrency = 320 -> 20
            # (7 unchanged attributes hidden)

          ~ containers {
                # (5 unchanged attributes hidden)

              ~ resources {
                  ~ limits            = {
                      ~ "memory" = "2Gi" -> "8Gi"
                        # (1 unchanged element hidden)
                    }
                    # (2 unchanged attributes hidden)
                }

                # (2 unchanged blocks hidden)
            }

          ~ scaling {
              ~ max_instance_count = 10 -> 20
              ~ min_instance_count = 2 -> 10
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_compute_backend_service.frontend_backend[0] will be updated in-place
  ~ resource "google_compute_backend_service" "frontend_backend" {
      ~ enable_cdn                                    = false -> true
        id                                            = "projects/dev-iac-demo/global/backendServices/demo-cost-frontend-backend"
        name                                          = "demo-cost-frontend-backend"
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_compute_global_address.external_ip[0] will be updated in-place
  ~ resource "google_compute_global_address" "external_ip" {
      ~ effective_labels   = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        id                 = "projects/dev-iac-demo/global/addresses/demo-cost-external-lb-ip"
      ~ labels             = {
          ~ "team"        = "finops-team" -> "finops-team-2"
            # (2 unchanged elements hidden)
        }
        name               = "demo-cost-external-lb-ip"
      ~ terraform_labels   = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # google_pubsub_subscription.sub_1[0] will be created
  + resource "google_pubsub_subscription" "sub_1" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = {
          + "application"                = "demo-cost"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "finops-team-2"
        }
      + id                         = (known after apply)
      + labels                     = {
          + "application" = "demo-cost"
          + "environment" = "dev"
          + "team"        = "finops-team-2"
        }
      + message_retention_duration = "604800s"
      + name                       = "demo-cost-sub-1"
      + project                    = "dev-iac-demo"
      + terraform_labels           = {
          + "application"                = "demo-cost"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "finops-team-2"
        }
      + topic                      = "demo-cost-topic"
    }

  # google_pubsub_subscription.sub_2[0] will be created
  + resource "google_pubsub_subscription" "sub_2" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = {
          + "application"                = "demo-cost"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "finops-team-2"
        }
      + id                         = (known after apply)
      + labels                     = {
          + "application" = "demo-cost"
          + "environment" = "dev"
          + "team"        = "finops-team-2"
        }
      + message_retention_duration = "604800s"
      + name                       = "demo-cost-sub-2"
      + project                    = "dev-iac-demo"
      + terraform_labels           = {
          + "application"                = "demo-cost"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "finops-team-2"
        }
      + topic                      = "demo-cost-topic"
    }

  # google_pubsub_topic.main_topic[0] will be updated in-place
  ~ resource "google_pubsub_topic" "main_topic" {
      ~ effective_labels           = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        id                         = "projects/dev-iac-demo/topics/demo-cost-topic"
      ~ labels                     = {
          ~ "team"        = "finops-team" -> "finops-team-2"
            # (2 unchanged elements hidden)
        }
      + message_retention_duration = "604800s"
        name                       = "demo-cost-topic"
      ~ terraform_labels           = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # google_redis_instance.cache[0] will be updated in-place
  ~ resource "google_redis_instance" "cache" {
      ~ effective_labels            = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        id                          = "projects/dev-iac-demo/locations/us-central1/instances/demo-cost-redis"
      ~ labels                      = {
          ~ "team"        = "finops-team" -> "finops-team-2"
            # (2 unchanged elements hidden)
        }
      ~ memory_size_gb              = 10 -> 20
        name                        = "demo-cost-redis"
      ~ replica_count               = 1 -> 2
      ~ terraform_labels            = {
          ~ "team"                       = "finops-team" -> "finops-team-2"
            # (3 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_secret_manager_secret.secret[0] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "application"                = "demo-cost"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "finops-team-2"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "application" = "demo-cost"
          + "environment" = "dev"
          + "team"        = "finops-team-2"
        }
      + name                  = (known after apply)
      + project               = "dev-iac-demo"
      + secret_id             = "demo-cost-secret"
      + terraform_labels      = {
          + "application"                = "demo-cost"
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "finops-team-2"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_sql_database_instance.postgres[0] will be created
  + resource "google_sql_database_instance" "postgres" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_14"
      + deletion_protection            = true
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "demo-cost-pg"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "dev-iac-demo"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "us-central1"
      + replica_names                  = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "REGIONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = true
          + disk_autoresize_limit       = 0
          + disk_size                   = 500
          + disk_type                   = (known after apply)
          + edition                     = "ENTERPRISE_PLUS"
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-perf-optimized-16"
          + user_labels                 = {
              + "application" = "demo-cost"
              + "environment" = "dev"
              + "team"        = "finops-team-2"
            }
          + version                     = (known after apply)

          + data_cache_config {
              + data_cache_enabled = true
            }

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "projects/sha-dmartinez-network/global/networks/my-dev-vpc"
              + server_ca_mode  = (known after apply)
              + ssl_mode        = "ENCRYPTED_ONLY"
            }
        }
    }

  # google_sql_user.iam_user[0] will be created
  + resource "google_sql_user" "iam_user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "demo-cost-pg"
      + name                    = "demo-cost-backend-sa@dev-iac-demo.iam"
      + project                 = "dev-iac-demo"
      + sql_server_user_details = (known after apply)
      + type                    = "CLOUD_IAM_SERVICE_ACCOUNT"
    }

Plan: 5 to add, 6 to change, 0 to destroy.
```
</details>
<!-- terragrunt-plan-for: live/dev/demo-cost -->